package org.ytymark.enums;


/**
 * 项目名称：ytyedit-mark
 * 作者：渊渟岳
 * 描述：SVG图标
 */
public enum SVGIconCode {
    // 最小化按钮图标: -
    MINIMIZE_ICON("M 3 9 H 24 V 10 H 3 Z"),
    // 最大化按钮图标: 🗖
    MAXIMIZE_ICON("M4 4 H20 V20 H4 Z M5 5 V19 H19 V5 H5 Z"),
    // 还原/复制按钮图标: 🗗
    REDUCTION_ICON("M12 0 H0 a1.1 1.1 0 0 0 -1.1 1.1 v2.44444 H-3.55556 a1.1 1.1 0 0 0 -1.1 1.1 v12 a1.1 1.1 0 0 0 1.1 1.1 h12 a1.1 1.1 0 0 0 1.1 -1.1 v-2.44444 h2.79259 a1.1 1.1 0 0 0 1.1 -1.1 V1.11111 a1.1 1.1 0 0 0 -1.1 -1.1 z\n" +
            "m-3.33333 16.66667 a0.22222 0.22222 0 0 1 -0.22222 0.22222 H-3.55556 a0.22222 0.22222 0 0 1 -0.22222 -0.22222 V4.66667 a0.22222 0.22222 0 0 1 0.22222 -0.22222 h12 a0.22222 0.22222 0 0 1 0.22222 0.22222 z\n" +
            "m3.55556 -3.55556 a0.22222 0.22222 0 0 1 -0.22222 0.22222 h-2.44444 V4.66667 a1.1 1.1 0 0 0 -1.1 -1.1 H-0.22222 V1.11111 a0.22222 0.22222 0 0 1 0.22222 -0.22222 h12 a0.22222 0.22222 0 0 1 0.22222 0.22222 z\n"),
    // 关闭按钮图标：×
    CLOSE_ICON("M13.35 12 L19.2 17.85 L17.85 19.2 L12 13.35 L6.15 19.2 L4.8 17.85 L10.65 12 L4.8 6.15 L6.15 4.8 L12 10.65 L17.85 4.8 L19.2 6.15 Z"),
    ;

    SVGIconCode(String iconCode) {
        this.iconCode = iconCode;
    }

    private final String iconCode;

    public String getIconCode() {
        return iconCode;
    }
}
